СправочникиИДокументы_практика/src/Documents/ПродажаТоваров/ПродажаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТоваров</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СправочникиИДокументы_практика/src/Documents/ПродажаТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПроверкаТиповОбъектов(Команда)
	ПроверкаТиповОбъектовСервер();
КонецПроцедуры

&НаСервере
Процедура ПроверкаТиповОбъектовСервер()
	Сообщить(ТипЗнч(Объект));
	ОбъектБД = РеквизитФормыВЗначение("Объект");
	Сообщить(ТипЗнч(ОбъектБД));
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыФормы,Элементы.Товары);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("Номенклатура", ВыбранноеЗначение);
	
	СтрокиТаблицы = Объект.Товары.НайтиСтроки(ОтборСтрок);
	
	Если СтрокиТаблицы.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.Номенклатура = ВыбранноеЗначение;
КонецПроцедуры
